wpax-dcqos2/deathstarbench-social-network/2023-04-03T15-53-13UTC/10000R-1700c-5d-150t/wrk2_10000R_1700c_5d_150t_1iteration.txt
Running 5s test @ http://nginx-thrift:8080
  150 threads and 1700 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.76ms    1.92ms  12.61ms   79.03%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.26ms
 75.000%    6.50ms
 90.000%    8.26ms
 99.000%   12.61ms
 99.900%   16.30ms
 99.990%   20.03ms
 99.999%   23.04ms
100.000%   23.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.479     0.000000            1         1.00
       3.953     0.100000         4787         1.11
       4.303     0.200000         9579         1.25
       4.611     0.300000        14392         1.43
       4.919     0.400000        19143         1.67
       5.259     0.500000        23947         2.00
       5.447     0.550000        26321         2.22
       5.659     0.600000        28710         2.50
       5.899     0.650000        31139         2.86
       6.167     0.700000        33509         3.33
       6.503     0.750000        35911         4.00
       6.691     0.775000        37084         4.44
       6.915     0.800000        38291         5.00
       7.167     0.825000        39488         5.71
       7.459     0.850000        40675         6.67
       7.811     0.875000        41873         8.00
       8.019     0.887500        42472         8.89
       8.255     0.900000        43079        10.00
       8.511     0.912500        43673        11.43
       8.799     0.925000        44268        13.33
       9.159     0.937500        44872        16.00
       9.383     0.943750        45167        17.78
       9.615     0.950000        45461        20.00
       9.887     0.956250        45762        22.86
      10.167     0.962500        46060        26.67
      10.527     0.968750        46358        32.00
      10.759     0.971875        46514        35.56
      10.959     0.975000        46656        40.00
      11.239     0.978125        46806        45.71
      11.503     0.981250        46954        53.33
      11.799     0.984375        47105        64.00
      11.983     0.985938        47179        71.11
      12.183     0.987500        47253        80.00
      12.447     0.989062        47327        91.43
      12.703     0.990625        47402       106.67
      13.007     0.992188        47477       128.00
      13.191     0.992969        47514       142.22
      13.423     0.993750        47554       160.00
      13.655     0.994531        47589       182.86
      13.871     0.995313        47626       213.33
      14.183     0.996094        47664       256.00
      14.327     0.996484        47683       284.44
      14.535     0.996875        47701       320.00
      14.679     0.997266        47720       365.71
      14.991     0.997656        47739       426.67
      15.351     0.998047        47757       512.00
      15.607     0.998242        47767       568.89
      15.743     0.998437        47776       640.00
      15.967     0.998633        47785       731.43
      16.087     0.998828        47794       853.33
      16.383     0.999023        47804      1024.00
      16.575     0.999121        47808      1137.78
      16.751     0.999219        47814      1280.00
      16.975     0.999316        47819      1462.86
      17.135     0.999414        47822      1706.67
      17.775     0.999512        47827      2048.00
      17.903     0.999561        47829      2275.56
      18.223     0.999609        47832      2560.00
      18.319     0.999658        47834      2925.71
      18.335     0.999707        47836      3413.33
      18.879     0.999756        47839      4096.00
      18.975     0.999780        47840      4551.11
      19.071     0.999805        47841      5120.00
      19.103     0.999829        47842      5851.43
      19.135     0.999854        47843      6826.67
      20.031     0.999878        47845      8192.00
      20.031     0.999890        47845      9102.22
      20.415     0.999902        47846     10240.00
      20.415     0.999915        47846     11702.86
      20.495     0.999927        47847     13653.33
      21.183     0.999939        47848     16384.00
      21.183     0.999945        47848     18204.44
      21.183     0.999951        47848     20480.00
      21.183     0.999957        47848     23405.71
      22.767     0.999963        47849     27306.67
      22.767     0.999969        47849     32768.00
      22.767     0.999973        47849     36408.89
      22.767     0.999976        47849     40960.00
      22.767     0.999979        47849     46811.43
      23.039     0.999982        47850     54613.33
      23.039     1.000000        47850          inf
#[Mean    =        5.760, StdDeviation   =        1.919]
#[Max     =       23.024, Total count    =        47850]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  48004 requests in 5.01s, 548.01MB read
Requests/sec:   9588.11
Transfer/sec:    109.46MB